# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Jeppe\Google Drev\E4PRJ4 gDrive\Vuggesystem arbejdsdokumenter\Test\Integrationstest\vuggeControl\vuggeControl.cydsn\vuggeControl.cyprj
# Date: Wed, 27 May 2015 09:30:41 GMT
#set_units -time ns
create_clock -name {I2CVuggesystem_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {sensorI2C_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {I2CVuggesystem_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {sensorI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 7 13} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {t_clk} -source [get_pins {ClockBlock/hfclk}] -edges {1 601 1201} [list [get_pins {ClockBlock/udb_div_2}]]
create_generated_clock -name {debugOut_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/udb_div_3}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\Jeppe\Google Drev\E4PRJ4 gDrive\Vuggesystem arbejdsdokumenter\Test\Integrationstest\vuggeControl\vuggeControl.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Jeppe\Google Drev\E4PRJ4 gDrive\Vuggesystem arbejdsdokumenter\Test\Integrationstest\vuggeControl\vuggeControl.cydsn\vuggeControl.cyprj
# Date: Wed, 27 May 2015 09:30:31 GMT
